[
    {
        "id": 1,
        "title": "Frontend Developer",
        "company": "TechCorp",
        "location": "Madrid, España",
        "salary": "€45,000 - €60,000",
        "description": "Estamos buscando un desarrollador frontend con experiencia en React para diseñar y construir interfaces ricas y accesibles. Trabajarás estrechamente con product designers y backend engineers para convertir requisitos en componentes reutilizables, optimizados para rendimiento y SEO. Se valora experiencia en testing (Jest/RTL), optimización de carga y buenas prácticas de accesibilidad.",
        "tags": [
            "React",
            "TypeScript",
            "CSS"
        ]
    },
    {
        "id": 2,
        "title": "Backend Developer",
        "company": "DataStack",
        "location": "Barcelona, España",
        "salary": "€50,000 - €70,000",
        "description": "Desarrollador backend para diseñar APIs y servicios escalables en Node.js, con especial atención al modelado de datos y la fiabilidad. Serás responsable de la arquitectura de endpoints, optimización de consultas SQL y la implementación de pruebas automatizadas y métricas de rendimiento. Experiencia previa gestionando despliegues, monitorización y seguridad de datos será un plus.",
        "tags": [
            "Node.js",
            "PostgreSQL",
            "API"
        ]
    },
    {
        "id": 3,
        "title": "Full Stack Developer",
        "company": "StartupX",
        "location": "Valencia, España",
        "salary": "€40,000 - €55,000",
        "description": "Buscamos un desarrollador todoterreno capaz de tomar responsabilidad sobre el frontend y el backend en productos en rápido crecimiento. Participarás desde el diseño de features hasta su puesta en producción, realizando integraciones, optimización y mantenimiento. Valoramos autonomía, sentido productivo y experiencia con despliegues continuos y bases de datos tanto relacionales como NoSQL.",
        "tags": [
            "React",
            "Node.js",
            "MongoDB"
        ]
    },
    {
        "id": 4,
        "title": "Mobile Developer",
        "company": "AppWorks",
        "location": "Sevilla, España",
        "salary": "€35,000 - €50,000",
        "description": "Desarrollador móvil con experiencia en aplicaciones multiplataforma (Flutter) para crear experiencias nativas fluidas en Android e iOS. Serás responsable de arquitecturas limpias, integración con APIs REST/GraphQL, gestión del estado y optimización de rendimiento en dispositivos reales. También participarás en revisiones de diseño, pruebas en dispositivos y resolución de problemas relacionados con fragmentación de plataformas.",
        "tags": [
            "Flutter",
            "Dart",
            "REST"
        ]
    },
    {
        "id": 5,
        "title": "Data Engineer",
        "company": "InsightLabs",
        "location": "Bilbao, España",
        "salary": "€55,000 - €75,000",
        "description": "Ingeniero de datos encargado de diseñar y mantener pipelines de ingestión, transformación y almacenamiento de grandes volúmenes de información. Trabajarás con frameworks de procesamiento por lotes y en tiempo real, garantizando calidad de datos, lineage y gobernanza. Se requiere experiencia en optimización de ETL, orquestación (Airflow u otros) y despliegue en entornos cloud.",
        "tags": [
            "Spark",
            "Python",
            "AWS"
        ]
    },
    {
        "id": 6,
        "title": "DevOps Engineer",
        "company": "CloudBridge",
        "location": "Alicante, España",
        "salary": "€50,000 - €68,000",
        "description": "Ingeniero DevOps para automatizar flujos de CI/CD, gestionar infraestructura como código y mejorar la observabilidad de servicios. Serás responsable de pipelines de despliegue, estrategias de rollback, y políticas de costes y seguridad en entornos cloud. Buscamos experiencia práctica con contenedores, orquestación, herramientas de infraestructura y cultura de SRE.",
        "tags": [
            "Docker",
            "Kubernetes",
            "Terraform"
        ]
    },
    {
        "id": 7,
        "title": "QA Engineer",
        "company": "QualityFirst",
        "location": "Granada, España",
        "salary": "€30,000 - €42,000",
        "description": "Ingeniero de pruebas con experiencia en automatización y creación de suites de integración end-to-end para garantizar la calidad del producto. Realizarás diseño de casos de prueba, ejecución automática y manual, identificación de regresiones y colaboración con desarrollo para mejorar la cobertura. Se valoran conocimientos en pruebas de rendimiento, CI y prácticas de TDD/BDD.",
        "tags": [
            "Selenium",
            "Java",
            "TDD"
        ]
    },
    {
        "id": 8,
        "title": "Machine Learning Engineer",
        "company": "NeuroAI",
        "location": "Madrid, España",
        "salary": "€60,000 - €85,000",
        "description": "Ingeniero de ML para desarrollar y llevar a producción modelos supervisados y no supervisados, colaborar en la preparación de datos y construir pipelines reproducibles. Trabajarás en experimentación, validación, despliegue de modelos y monitorización de rendimiento y deriva de datos. Se valoran conocimientos en TensorFlow/PyTorch, MLOps, feature stores y escalado de inferencia en cloud.",
        "tags": [
            "Python",
            "TensorFlow",
            "MLOps"
        ]
    },
    {
        "id": 9,
        "title": "Product Manager",
        "company": "BrightProducts",
        "location": "Barcelona, España",
        "salary": "€48,000 - €70,000",
        "description": "Product manager orientado a productos SaaS responsable de definir roadmap, priorizar funcionalidades y alinear equipos técnicos y de negocio. Deberás realizar análisis de mercado, trabajar con métricas clave (activation, retention, ARR) y coordinar lanzamientos enfocados en la experiencia del usuario. Se busca habilidad para traducir feedback de clientes en requisitos claros y métricas de éxito.",
        "tags": [
            "Roadmap",
            "OKR",
            "UX"
        ]
    },
    {
        "id": 10,
        "title": "UI/UX Designer",
        "company": "CreativeStudio",
        "location": "Zaragoza, España",
        "salary": "€30,000 - €45,000",
        "description": "Diseñador UI/UX para crear interfaces móviles y web centradas en el usuario, desde investigación hasta prototipado y handoff a desarrollo. Realizarás pruebas de usabilidad, mapas de experiencia, y colaborarás en definir patrones y sistemas de diseño que escalen con el producto. Se valora dominio de herramientas como Figma, prototipado interactivo y buenas prácticas de accesibilidad.",
        "tags": [
            "Figma",
            "Prototyping",
            "User Research"
        ]
    },
    {
        "id": 11,
        "title": "Security Engineer",
        "company": "SafeNet",
        "location": "Pamplona, España",
        "salary": "€58,000 - €80,000",
        "description": "Especialista en ciberseguridad responsable de realizar auditorías, pruebas de intrusión y diseñar controles para reducir riesgos técnicos y de proceso. Participarás en respuesta a incidentes, análisis forense y definición de políticas de seguridad, así como en la formación de equipos para prácticas seguras. Conocimiento de marcos de seguridad, SIEM y herramientas de testing es imprescindible.",
        "tags": [
            "Pentesting",
            "SIEM",
            "OWASP"
        ]
    },
    {
        "id": 12,
        "title": "Cloud Architect",
        "company": "ScaleCloud",
        "location": "Murcia, España",
        "salary": "€70,000 - €95,000",
        "description": "Arquitecto cloud para diseñar soluciones escalables, resilientes y coste-eficientes en proveedores públicos, definiendo patrones de microservicios y networking. Serás responsable de establecer buenas prácticas de automatización, seguridad y gobernanza en entornos multi-account. Se requiere experiencia en migraciones, optimización de costes y evaluación de trade-offs técnicos para cargas críticas.",
        "tags": [
            "AWS",
            "GCP",
            "Microservices"
        ]
    },
    {
        "id": 13,
        "title": "Technical Support Engineer",
        "company": "HelpHero",
        "location": "Oviedo, España",
        "salary": "€25,000 - €35,000",
        "description": "Soporte técnico de segundo nivel para clientes empresariales, encargado de diagnóstico profundo, escalado y documentación de soluciones. Colaborarás con equipos de producto para reproducir incidencias, proponer mejoras y mantener bases de conocimiento actualizadas. Se valoran habilidades en sistemas Linux, redes y trato cercano con clientes en situaciones críticas.",
        "tags": [
            "Linux",
            "Networking",
            "Customer Support"
        ]
    }
]